Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Extract connection information from the container (connection URL, credentials, database name, etc.)
ja_jp: コンテナーから接続情報 (接続 URL、クレデンシャル、データベース名など) を抽出します。

source: Extract data from your documents with Apache Tika
ja_jp: Apache Tika を使用してドキュメントからデータを抽出する

source: Extract metrics out of your services
ja_jp: サービスからメトリクスを抽出する

source: Extract the `langlinks` array from the response.
ja_jp: レスポンスから `langlinks` 配列を取り出します。

source: Extracting Content with Apache Tika
ja_jp: Apache Tika でのコンテンツの抽出

source: Extreme productivity
ja_jp: 極限の生産性

source: FAQs
ja_jp: FAQ

source: FYI, I just deployed 10 services in case you are wondering.
ja_jp: ご参考までに、10のサービスを展開してみました。

source: Facebook will not let you test your application on `localhost` like most other OIDC providers: you will need to run it over HTTPS and make it publicly accessible, so for development purposes you may want to use a service such as https://ngrok.com.
ja_jp: Facebook では、他のほとんどの OIDC プロバイダーのように `localhost` でアプリケーションをテストすることはできません。HTTPS で実行して公開する必要があるため、開発目的では https://ngrok.com などのサービスを使用することをお勧めします。

source: Facebook you will not be let you test your application on `localhost` like most other OIDC providers: you will need to run it over HTTPS and make it publicly accessible, so for development purposes you may want to use a service such as https://ngrok.com.
ja_jp: Facebook では、他のほとんどの OIDC プロバイダーのように `localhost` でアプリケーションをテストすることはできません。 HTTPS で実行して公開する必要があるため、開発目的では https://ngrok.com などのサービスを使用することをお勧めします。

source: Facebook you will not be let you test your application on `localhost` like most other OIDC providers: you will need to run it over `https` and make it publicly accessible, so for development purposes you may want to use a service such as https://ngrok.com.
ja_jp: Facebook では、他のほとんどの OIDC プロバイダーのように `localhost` でアプリケーションをテストすることはできません。 `https` で実行して公開する必要があるため、開発目的では https://ngrok.com などのサービスを使用することをお勧めします。

source: Fail on missing key
ja_jp: キーがない場合に失敗させるかどうか

source: Fail on missing state parameter
ja_jp: state パラメーターがない場合に失敗させるかどうか

source: Failure Handler Example
ja_jp: 失敗ハンドラーの例

source: Failure Handling Strategies
ja_jp: 失敗処理ストラテジー

source: Failure Management
ja_jp: 失敗の管理

source: Failure handling
ja_jp: エラーハンドリング

source: Fallback configuration properties
ja_jp: 設定プロパティーのフォールバック

source: Fallback native images are a feature of GraalVM to "fall back" to run your application in the normal JVM, should the compilation to native code fail for some reason.
ja_jp: フォールバックネイティブイメージは、何らかの理由でネイティブコードへのコンパイルに失敗した場合に、アプリケーションを通常のJVMで実行するために「フォールバック」するためのGraalVMの機能です。

source: Fallback to the default static tenant configuration resolution defined in the `application.properties` file or other SmallRye Config sources.
ja_jp: `application.properties` ファイルまたはその他の SmallRye Config ソースで定義されているデフォルトの静的テナント設定解決にフォールバックします。

source: Fallback to the first constructor it finds, this could lead to multiple problems or inconsistencies.
ja_jp: 最初に見つかったコンストラクターにフォールバックすると、複数の問題や不整合につながる可能性があります。

source: False Positives in Security Scans
ja_jp: セキュリティスキャンの誤検知について

source: Fast JAR packaging uses a Quarkus-specific filesystem directory layout that contains files generated by Quarkus and Maven artifacts that are runtime dependencies of an application.
ja_jp: Fast JAR パッケージングでは、Quarkus 固有のファイルシステムディレクトリーレイアウトが使用されます。これには、Quarkus によって生成されたファイルと、アプリケーションのランタイム依存関係である Maven アーティファクトが含まれています。

source: Fast JWT Generation
ja_jp: JWT の迅速な生成

source: Fast JWT generation
ja_jp: JWT の高速生成

source: Fast Startup Time
ja_jp: 高速な起動時間

source: Fast growing eco-system through the core extensions, the universe extensions (e.g. camel) and the Quarkiverse
ja_jp: コアのエクステンション、ユニバースエクステンション（例：camel）、Quarkiverseによる急成長のエコシステム

source: Fast jar as default
ja_jp: Fast jarのデフォルト化

source: Fast jar is now the default packaging when you build a jar.
ja_jp: Fast jar は、jar をビルドする際のデフォルトのパッケージングになりました。

source: Faster for I/O operations as it avoids unnecessary copying.
ja_jp: 不要なコピーを回避するため、I/O 操作が高速です。

source: Faster validation and lazy loading of quick fixes.
ja_jp: 検証の高速化とクイックフィックスの遅延ロード。

source: Fault Tolerance
ja_jp: フォールトトレランス

source: Fault Tolerance: provide retry, fallback, circuit breakers abilities to your application.It can be used with Mutiny types.
ja_jp: フォールトトレランス: リトライ、フォールバック、サーキットブレーカーなどの機能をアプリケーションに提供します。Mutiny型と一緒に利用出来ます。

source: Favor build time work over runtime work
ja_jp: ランタイムワークよりもビルドタイムワーク

source: Feature required
ja_jp: 必要な機能

source: Feature sets aside, the Quarkus application that is run under dev mode differs architecturally from the production application (i.e. the one that is run using `java -jar ...`).
ja_jp: 機能セットはさておき、開発モードで実行される Quarkus アプリケーションは、プロダクションアプリケーション (すなわち、 `java -jar …​` を使用して実行されるもの) とはアーキテクチャ的に異なります。

source: Feature sets aside, the Quarkus application that is run under dev-mode differs architecturally from the production application (i.e. the one that is run using `java -jar ...`).
ja_jp: 機能セットはさておき、dev-modeで実行されるQuarkusアプリケーションは、プロダクションアプリケーション（すなわち、 `java -jar …​` を使用して実行されるもの）とはアーキテクチャ的に異なります。

source: Features
ja_jp: 特徴

source: Features and Capabilities
ja_jp: フィーチャーとケイパビリティ

source: Feedback
ja_jp: フィードバック

source: Feedback and Help
ja_jp: フィードバックとヘルプ

source: Feedback and contributions are very welcome in this area.
ja_jp: この分野でのフィードバックや貢献を大いに歓迎します。

source: Feedback is very welcome so if you have a Quarkus app around, please give it a go.
ja_jp: フィードバックをお待ちしておりますので、Quarkusのアプリをお持ちの方はぜひお試しください。

source: Feel free to update the assembly descriptor to include additional files such as LICENSE, readme, or anything else needed by the consumers of the executable. Make another commit right here with "build: Configure distribution assembly".
ja_jp: アセンブリ記述子を自由に更新して、LICENSE、readme、または実行可能ファイルのコンシューマーが必要とするその他のファイルを追加してください。ここでビルド: ディストリビューションアセンブリの設定を使用して別のコミットを行います。

source: Fetch the `size` top hits, `20` by default. Obviously, paging is also supported.
ja_jp: `size` で指定した数の一致度が高いものをフェッチします。デフォルトでは `20` です。もちろんページングもサポートしています。

source: Fetch the user emails with Vert.x WebClient
ja_jp: Vert.x WebClient を使用してユーザーのメールを取得します。

source: Field injection
ja_jp: フィールド・インジェクション

source: Field, constructor and initializer/setter injection
ja_jp: フィールド、コンストラクター、イニシャライザー/セッター挿入

source: Fields include `@timestamp`, `log.logger`, `log.level`, `process.pid`, `process.name`, `process.thread.name`, `process.thread.id`, `host.hostname`, `event.sequence`, `error.message`, `error.stack_trace`, `ecs.version`, `data_stream.type`, `service.name`, `service.version`, and `service.environment`.
ja_jp: フィールドには、`@timestamp`, `log.logger`, `log.level`, `process.pid`, `process.name`, `process.thread.name`, `process.thread.id`, `host.hostname`, `event.sequence`, `error.message`, `error.stack_trace`, `ecs.version`, `data_stream.type`, `service.name`, `service.version`, `service.environment` が含まれます。

source: Fields of the test class that are annotated with `@jakarta.inject.Inject` and `@io.quarkus.test.InjectMock` are injected after a test instance is created. Furthermore, the parameters of a test method for which a matching bean exists are resolved unless annotated with `@io.quarkus.test.component.SkipInject` or `@org.mockito.Mock`. There are also some JUnit built-in parameters, such as `RepetitionInfo` and `TestInfo`, which are skipped automatically.
ja_jp: `@jakarta.inject.Inject` および `@io.quarkus.test.InjectMock` でアノテーションが付けられたテストクラスのフィールドは、テストインスタンスが作成された後に注入されます。 さらに、一致する Bean が存在するテストメソッドのパラメーターが解決されます (`@io.quarkus.test.component.SkipInject` または `@org.mockito.Mock` でアノテーションが付けられている場合を除く)。 また、 `RepetitionInfo` や `TestInfo` など、自動的にスキップされる JUnit 組み込みパラメーターもいくつかあります。

source: Fields specified as `File`, `Path`, `byte[]` or `Buffer` are sent as files; as binary files for `@PartType(MediaType.APPLICATION_OCTET_STREAM)`, as text files for other content types. Other fields are sent as form attributes.
ja_jp: File`、 `Path`、 `byte[]` または `Buffer` として指定されたフィールドはファイルとして送信されます。 `@PartType(MediaType.APPLICATION_OCTET_STREAM)` の場合はバイナリーファイル、その他のコンテンツタイプの場合はテキストファイルとして送信されます。その他のフィールドはフォームの属性として送信されます。

source: Fight Service
ja_jp: ファイトサービス

source: Fight Statistics
ja_jp: 対戦統計

source: Fight service: http://localhost:8082[http://localhost:8082^]
ja_jp: ファイトサービス: http://localhost:8082[http://localhost:8082^]

source: Figure 10: Qute section completion using section start
ja_jp: 図10：セクションスタートによるQuteのセクション補完

source: Figure 11: Parameter declaration Qute quick fix suggestion
ja_jp: 図 11: パラメータ宣言 Qute クイックフィックスの提案

source: Figure 12: Qute validation settings for global and local validation enablement
ja_jp: 図 12: Qute のグローバルおよびローカルな検証を有効にするための設定

source: Figure 13: Enable/disable Qute validation per file and globally
ja_jp: 図 13: ファイル単位およびグローバルでの Qute 検証の有効化/無効化

source: Figure 14: Support and Java doc for built-in Qute value resolvers, such as take, orEmpty and or
ja_jp: 図14：take、orEmpty、orなどの組み込みのQute value resolverのサポートとJavaドキュメント

source: Figure 15: Support for `@TemplateExtension` data model methods
ja_jp: 図 15： `@TemplateExtension` データモデルメソッドのサポート

source: Figure 16: Using the `@Named` annotation allows Beans injection support for Qute templates
ja_jp: 図16： `@Named` アノテーションの使用により、Quteテンプレートに対するBeanインジェクションのサポートが可能になります。

source: Figure 1: Supported Qute language modes
ja_jp: 図1：対応するQuteの言語モード

source: Figure 2: Qute extension option in extension stage of _Quarkus: Generate a Quarkus project_ command
ja_jp: 図2: _Quarkusの_拡張ステージにおけるQuteエクステンションオプション _：Quarkusプロジェクトの生成_コマンド

source: Figure 3 shows the overall architecture of the application.
ja_jp: 図3は、本アプリケーションの全体的なアーキテクチャを示しています。

source: Figure 3: The Qute CodeLens setting
ja_jp: 図3：Qute CodeLensの設定画面

source: Figure 4: CodeLens generation of and navigation to Qute template file using `Template`
ja_jp: 図4：`Template` を用いた、CodeLensによるQuteテンプレート・ファイルの生成とナビゲーション

source: Figure 5: CodeLens generation of and navigation to Qute template file using `@CheckedTemplate`
ja_jp: 図5：`@CheckedTemplate` を用いたQuteテンプレート・ファイルへのナビゲーションとCodeLensの生成

source: Figure 6: Overview of Java-to-template interaction
ja_jp: 図6：Java-to-templateインタラクションの概要

source: Figure 7: Method parameter support for built-in Java methods and Quarkus Java files
ja_jp: 図7：組み込みJavaメソッドとQuarkus Javaファイルのメソッドパラメータのサポート

source: Figure 8: Java type hover support for built-in Java classes and user defined classes
ja_jp: 図8：組み込みJavaクラスとユーザー定義クラスのJavaタイプホバーサポート

source: Figure 9: Qute template linked editing support
ja_jp: 図9：Quteテンプレート連動編集サポート

source: File TRACE Logging Configuration
ja_jp: ファイル TRACE ログ設定

source: File TRACE logging configuration
ja_jp: ファイル TRACE ロギング設定

source: File conventions
ja_jp: ファイル規約

source: File log handler
ja_jp: ファイルログハンドラー

source: File names
ja_jp: ファイル名

source: File naming conventions
ja_jp: ファイルの命名規則

source: Fill in a key name, enable `Sign in with Apple`, and press `Configure`:
ja_jp: キー名を入力し、 `Sign in with Apple` を有効にして、 `Configure` を押します。

source: Fill in your application name, select `Accounts in any organizational directory (Any Azure AD directory - Multitenant) and personal Microsoft accounts (e.g. Skype, Xbox)` to allow anyone to log in, and add a `Web` Redirect URI as `http://localhost:8080/_renarde/security/oidc-success`, then click on `Register`:
ja_jp: アプリケーション名を入力し、 `Accounts in any organizational directory (Any Azure AD directory - Multitenant) and personal Microsoft accounts (e.g. Skype, Xbox)` を選択して誰でもログインできるようにし、 `Web` Redirect URI を `http://localhost:8080/_renarde/security/oidc-success` として追加してから `Register` をクリックします。

source: Fill in your application name, select `Accounts in any organizational directory (Any Azure AD directory - Multitenant) and personal Microsoft accounts (e.g. Skype, Xbox)` to allow anyone to log in, and add a `Web` Redirect URI as `http://localhost:8080/microsoft`, then click on `Register`:
ja_jp: アプリケーション名を入力し、 `Accounts in any organizational directory (Any Azure AD directory - Multitenant) and personal Microsoft accounts (e.g. Skype, Xbox)` を選択して誰でもログインできるようにし、 `Web` Redirect URI を `http://localhost:8080/microsoft` として追加してから `Register` をクリックします。

source: Filter by keyword
ja_jp: キーワードで絞り込む

source: Filter object that allows to limit the scope of reindexing.
ja_jp: インデックスの再作成範囲を制限できるフィルターオブジェクト。

source: Filter out abstract classes
ja_jp: 抽象クラスの除外

source: Filter parameters
ja_jp: パラメーターをフィルター

source: Filter return types
ja_jp: 戻り値の型のフィルター

source: Filter the Extensions
ja_jp: エクステンションのフィルタリング

source: Filtering by fields is only supported for String, Boolean, Character, Double, Float, Integer, Long, Short, Byte and the primitive types.
ja_jp: フィールドによるフィルタリングは、String、Boolean、Character、Double、Float、Integer、Long、Short、Byteおよびプリミティブ型にのみ対応しています。

source: Filtering configuration options
ja_jp: 設定オプションのフィルタリング

source: Filtering of operations
ja_jp: オペレーションのフィルタリング

source: Filtering out events
ja_jp: イベントのフィルタリング

source: Filters
ja_jp: フィルター

source: Filters which run during the build of the application - i.e. `BUILD` Stage filters (See also <<Advanced interactions of RunStages>>) - the Jandex index can be passed in the constructor. During application runtime, the Jandex index will *not* be null. However it will be empty, i.e it won't contain info about any classes or annotations.
ja_jp: アプリケーションのビルド中に実行されるフィルター、つまり `BUILD` ステージのフィルター (<<advanced-interactions-of-runstages,RunStages の高度な相互作用>> も参照) では、Jandex インデックスをコンストラクターに渡すことができます。アプリケーションの実行中、Jandex インデックスは *null* にはなりませんが、空になります。つまり、クラスやアノテーションに関する情報は含まれません。

source: Final fields are not considered for injection, but can be populated by way of constructor parameter injection if desired. Static fields are never considered for injection.
ja_jp: finalフィールドはインジェクションの対象にはなりませんが、必要に応じてコンストラクタのパラメータインジェクションで入力することができます。staticフィールドは、インジェクションの対象にはなりません。

source: Final touch, the HTML page reading the converted prices using SSE.
ja_jp: 最後に、変換された価格をSSEを使って読み込むHTMLページです。

source: Final touch, the HTML page requesting quotes and displaying the prices obtained over SSE.
ja_jp: 見積をリクエストし、SSE で取得した価格を表示する HTML ページの最終調整を行います。

source: Finally `./greeting-extension/runtime/pom.xml`.
ja_jp: 最後に `./greeting-extension/runtime/pom.xml` を見ていきます。

source: Finally both the confidentiality and integrity of the claims can be further enforced by signing them first and then encrypting the nested JWT token.
ja_jp: 最後に、クレームの機密性と完全性の両方を、まず署名し、次にネストしたJWTトークンを暗号化することによって、さらに強化することができます。

source: Finally note that the last rule collecting all the approved loan applications into a global `List` has been replaced by a query simply retrieving them. One of the advantages in using a rule unit is that it clearly defines the context of computation, in other terms the facts to be passed in input to the rule evaluation. Similarly, the query defines what is the output expected by this evaluation.
ja_jp: 最後に、承認されたローン申請をすべてグローバルな `List` に収集する最後のルールが、単にそれらを取得するクエリーに置き換えられたことに注意してください。ルールユニットを使用する利点の 1 つとして、計算のコンテキスト、つまりルール評価に入力として渡される事実を明確に定義できる点が挙げられます。同様に、クエリーはこの評価によって想定される出力を定義します。

source: Finally update `GreetingResource` to request that `ApiEchoService` echoes a user name:
ja_jp: 最後に、 `ApiEchoService` がユーザー名をエコーするようにリクエストするように、 `GreetingResource` を更新します。

source: Finally we create a business process that will make use of this rule and some other activities to approve a given person. Using new item wizard (File -> New -> Other -> BPMN2 Model) create `persons.bpmn` inside `src/main/resources/org/acme/kogito` folder of the generated project.
ja_jp: 最後に、このルールを利用して、指定された人物を承認するビジネスプロセスを作成します。新規項目ウィザード(File -> New -> Other -> BPMN2 Model)を使用して、生成されたプロジェクトの `src/main/resources/org/acme/kogito` フォルダー内に `persons.bpmn` を作成します。

source: Finally write a test code the same way as it is described in the <<integration-testing-wiremock, Wiremock>> section above. The only difference is that `@QuarkusTestResource` is no longer needed:
ja_jp: 最後に、上記の xref:integration-testing-wiremock[Wiremock] のセクションで説明したのと同じ方法でテストコードを記述します。 唯一の違いは、 `@QuarkusTestResource` が不要になったことです：

source: Finally write your test which will be executed in JVM mode:
ja_jp: 最後に、JVM モードで実行されるテストを作成します。

source: Finally you can select a `Log Out` image::dev-ui-keycloak-logout.png option if you'd like to log out and authenticate to Keycloak as a different user.
ja_jp: 最後に、ログアウトして別のユーザーとして Keycloak で認証する場合は、 `Log Out` image::dev-ui-keycloak-logout.png オプションを選択できます。

source: Finally, you need to configure the Google Calendar address and request the Google Calendar scope for an access token, as outlined in the following example:
ja_jp: 最後に、次の例に示すように、Google カレンダーのアドレスを設定し、アクセストークンの Google カレンダースコープを要求する必要があります。

source: Finally, Secured Access to /secured/roles-allowed
ja_jp: /secured/roles-allowed へのセキュリティーで保護されたアクセス

source: Finally, `matchNames()` can be used to specify a collection of matching names. An additional string method parameter is mandatory as well.
ja_jp: 最後に、 `matchNames()` を使用して、一致する名前のコレクションを指定することができます。追加の文字列メソッド・パラメータも必須です。

source: Finally, add a Jakarta REST `ExceptionMapper`:
ja_jp: 最後に、Jakarta REST `ExceptionMapper` を追加します。

source: Finally, add a `@ConvertGroup` annotation next to your `@Valid` annotation in your validated method.
ja_jp: 最後に、検証済みメソッドの `@Valid` アノテーションの横に `@ConvertGroup` アノテーションを追加します。

source: Finally, all calls to `Log` methods are rewritten to regular JBoss Logging calls on the logger field during the application build.
ja_jp: 最後に、 `Log` メソッドへのすべての呼び出しは、アプリケーションビルド中に logger フィールドの通常の JBoss Logging 呼び出しに書き換えられます。

source: Finally, all you need to do is to configure your favorite IDE to attach the java agent process that is forwarded to `localhost:5005` and start to debug your application. For example, in IntelliJ IDEA, you can follow https://www.jetbrains.com/help/idea/tutorial-remote-debug.html[this tutorial] to debug remote applications.
ja_jp: 最後に、やらなければならないのは、`localhost:5005` に転送される java エージェントプロセスをアタッチするようにお気に入りの IDE を設定し、アプリケーションのデバッグを開始することだけです。たとえば、IntelliJ IDEA では、 https://www.jetbrains.com/help/idea/tutorial-remote-debug.html:[このチュートリアル] に従って、リモートアプリケーションのデバッグを行うことができます。

source: Finally, although we haven’t done it yet, this approach could easily be extended to other types of JAX-RS Providers thus completely forgoing the need to use `@Context` in their code.
ja_jp: 最後に、まだ実施していませんが、このアプローチは他のタイプのJAX-RSプロバイダにも簡単に拡張でき、コード中で `@Context` を使用する必要が完全になくなります。

source: Finally, an option of replacing the Vert.x OIDC with Quarkus OIDC will be explained for you to analyze and consider implementing it.
ja_jp: 最後に、Vert.x OIDC を Quarkus OIDC に置き換えるオプションについて説明します。これを分析し、実装を検討してください。

source: Finally, at the startup time, you should restore the already registered client instead of registering it again.
ja_jp: 最後に、起動時に、すでに登録されているクライアントを再度登録するのではなく、そのクライアントを復元する必要があります。

source: Finally, authenticate your local Docker installation with this container registry by running:
ja_jp: 最後に、このコンテナーレジストリーを実行して、ローカルのDockerインストールを認証します。

source: Finally, both the confidentiality and integrity of the claims can be further enforced by signing them first and then encrypting the nested JWT token.
ja_jp: さらに、クレームに署名してからネストされた JWT トークンを暗号化することにより、クレームの機密性と整合性の両方を強化できます。

source: Finally, build the native executable, package, and deploy your application to {openshift}:
ja_jp: 最後に、ネイティブ実行可能ファイルをビルドし、アプリケーションをパッケージ化して {openshift} にデプロイします:

source: Finally, configure your application to send logs to EFK using Syslog:
ja_jp: 最後に、Syslogを使用してEFKにログを送信するようにアプリケーションを設定します:

source: Finally, configure your channels to use the JSON-B serializer and deserializer.
ja_jp: 最後に、JSON-B シリアライザーとデシリアライザーを使用するようにチャネルを設定します。

source: Finally, configure your channels to use the Jackson serializer and deserializer.
ja_jp: 最後に、Jackson シリアライザーとデシリアライザーを使用するようにチャンネルを設定します。

source: Finally, create `index.hbs` and `protected.hbs` templates in the `src/main/resources/views` directory, copy their content from the https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] tutorial.
ja_jp: 最後に、 `src/main/resources/views` ディレクトリーに `index.hbs` と `protected.hbs` テンプレートを作成し、 https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] チュートリアルから内容をコピーします。

source: Finally, create a *template instance*, set the data and render the output:
ja_jp: 最後に *テンプレートインスタンス* を作成し、データをセットして出力をレンダリングします。

source: Finally, create the `org.acme.microprofile.faulttolerance.CoffeeResource` class as follows:
ja_jp: 最後に、 `org.acme.microprofile.faulttolerance.CoffeeResource` クラスを以下のように作成します。 :

source: Finally, during application build, all calls to `Log` methods are rewritten to regular JBoss Logging calls on the logger field.
ja_jp: 最後に、アプリケーションのビルド時に、 `Log` メソッドへのすべての呼び出しが、logger フィールド上の通常の JBoss Logging 呼び出しに書き換えられます。

source: Finally, generate the documentation and check it out.
ja_jp: 最後にドキュメントを生成して確認します。

source: Finally, if port 8080 or port 8081 is not available on your computer, you can modify the dev and test mode ports with application.properties
ja_jp: 最後に、ポート 8080 またはポート 8081 がコンピューターで使用できない場合は、application.properties を使用して開発モードとテストモードのポートを変更できます。

source: Finally, if you decide to update the resoved configuration while the existing OIDC session is still active, you may to have the session cookie removed and the user re-authenticated to align with the latest tenant configuration requirements. Set a `RoutingContext` `remove-session-cookie` property to `true` if it is necessary:
ja_jp: 最後に、既存の OIDC セッションがまだアクティブな状態で解決済みの設定を更新することにした場合、最新のテナント設定要件に合わせるために、セッション Cookie を削除してユーザーを再認証する必要があるかもしれません。必要に応じて、`RoutingContext` の `remove-session-cookie` プロパティーを `true` に設定します。

source: Finally, if you declare
ja_jp: 最後に、以下を宣言した場合

source: Finally, if you haven't done it already, please https://plugins.jetbrains.com/plugin/13234-quarkus-tools[add your review to the JetBrains marketplace]. Your feedback matters!
ja_jp: 最後に、まだの方は、 link:https://plugins.jetbrains.com/plugin/13234-quarkus-tools[JetBrainsマーケットプレイスにレビューを追加して] ください。あなたのフィードバックが重要です！

source: Finally, implement the `/api/users/me` endpoint. As you can see from the source code example below, we are trusting only users with the `user` role. We are also using `SecurityContext` to get access to the currently authenticated `Principal`, and we return the user name, all of which is loaded from the database.
ja_jp: 最後に、 `/api/users/me` エンドポイントを考えてみましょう。下のソースコードを見ればわかるように、 `user` の役割を持つユーザのみを信頼しています。現在認証されている `Principal` へのアクセスを得るために `SecurityContext` を使用しており、ユーザーの名前を返します。この情報はデータベースから読み込まれます。

source: Finally, in the Quarkus Avro Processor (part of the Quarkus extension), we register for reflection all the classes annotated with `@AvroGenerated`, as we are using reflection to create new instances of them.
ja_jp: 最後に、Quarkus Avro Processor(Quarkusエクステンションの一部)で、 `@AvroGenerated` でアノテーションされたすべてのクラスをリフレクションの為に登録します。新しいインスタンスの生成にリフレクションを使用している為です。

source: Finally, just a brief mention about other bcc/eBPF commands, and how to transform them into flamegraphs.
ja_jp: 最後に、他のbcc/eBPFコマンドと、それらをflamegraphに変換する方法について簡単に触れておきます。

source: Finally, launch `gcloud app deploy` in the root of your project, it will upload all your project files (the list can be reduced via the `.gcloudignore` file), build your Dockerfile and launch it on App Engine Flexible custom runtime.
ja_jp: 最後に、プロジェクトのルートで `gcloud app deploy` を起動すると、すべてのプロジェクトファイルをアップロードし( `.gcloudignore` ファイルを介してリストを縮小することができます)、Dockerfile をビルドし、App Engine Flexible カスタムランタイム上で起動します。

source: Finally, launch the components that compose the EFK Stack:
ja_jp: 最後に、EFKスタックを構成するコンポーネントを起動します:

source: Finally, launch the components that compose the Elastic Stack:
ja_jp: 最後に、Elastic Stackを構成するコンポーネントを起動します:

source: Finally, let's add a JAX-RS `ExceptionMapper`:
ja_jp: 最後に、JAX-RS の `ExceptionMapper` を追加します。
